# Упражнение №7*. Сделать русско-английский словарь
# В файле task6/en-ru.txt находятся строки англо-русского словаря в
# таком формате:
#
# cat - кошка
# dog - собака
# home - домашняя папка, дом
# mouse - мышь, манипулятор мышь
# to do - делать, изготавливать
# to make - изготавливать
# Здесь английское слово (выражение) и список русских слов (выражений)
# разделены двумя табуляциями и минусом: '\t-\t'.
#
# Требуется создать русско-английский словарь и вывести его в файл
# ru-en.txt в таком формате:
#
# делать - to do
# дом - home
# домашняя папка - home
# изготавливать - to do, to make
# кошка - cat
# манипулятор мышь - mouse
# мышь - mouse
# собака - dog
# Порядок строк в выходном файле должен быть словарным с человеческой
# точки зрения (так называемый лексикографический порядок слов).
# То есть выходные строки нужно отсортировать.

# Необязательное (под звездочкой) задание. Можно вернуться после окончания курса.