# Упражнение №8*. Синхронизация словарей
# Даны два файла словарей: task7/en-ru.txt и task7/ru-en.txt
# (в формате, описанном в упражнении №6).
#
# en-ru.txt:
#
# home - домашняя папка
# mouse - манипулятор мышь
# ru-en.txt:
#
# дом - home
# мышь - mouse
# Требуется синхронизировать и актуализировать их содержимое.
#
# en-ru.txt:
#
# home - домашняя папка, дом
# mouse - манипулятор мышь, мышь
# ru-en.txt:
#
# дом - home
# домашняя папка - home
# манипулятор мышь - mouse
# мышь - mouse

# Необязательное (под звездочкой) задание. Можно вернуться после окончания курса.